Revit 2027 API
ExporterIFC.ExportBaseQuantities Property
 Identifies if the export should include IFC standard quantities currently supported by Revit.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportBaseQuantities { get; }
Public ReadOnly Property ExportBaseQuantities As Boolean
	Get
public:
property bool ExportBaseQuantities {
	bool get ();
}
member ExportBaseQuantities : bool with get
Property Value
Boolean
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace